app/controllers/posts_controller.rb

INSERT INTO "posts" ("Description", "Language", "Movie_Scree", "Name", "Price", "created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@post = Post.new(post_params)
    if @post.save

SELECT "posts".* FROM "posts"
SELECT "posts".* FROM "posts" ORDER BY "posts"."name" ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
def index
  @posts = Post.all
  @posts = Post.page(params[:page]).order(:name).per(5)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "Movie_Scree" = ?, "Language" = ?, "updated_at" = ? WHERE "posts"."id" = 7  [["Movie_Scree", "5"], ["Language", "0"], ["updated_at", Thu, 13 Mar 2014 13:12:02 UTC +00:00]]
---
def update
  @post = Post.find(params[:id])

  if @post.update(params[:post].permit(:Name,:Movie_Scree, :Price , :Description, :Language))